app/controllers/songs_controller.rb

  def edit
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
      redirect_to artists_path, alert: "Artist not found"
    elsif !Song.exists?(params[:id])
      redirect_to artist_songs_path, alert: "Song not found"
    else
      @song = Song.find(params[:id])
---
SELECT "artists".* FROM "artists"
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]